Repository: 84000/data-translation-memory
Catalog: toh562-v3.tmx
Source language: bo
Languages: en

source: བསིལ་བའི་ཚལ་ཆེན་པོའི་མདོ།
en: The Sūtra of Great Cool Grove

source: དཀོན་མཆོག་གསུམ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the Three Jewels.

source: །འཇིག་རྟེན་མཁས་པ་རྫོགས་སངས་རྒྱས། །གང་གིས་ཐོག་མར་རིག་སྔགས་རྣམས། །འཛམ་བུའི་གླིང་དུ་གསུངས་པ་ཡི། །སངས་རྒྱས་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the glorious Buddha, The perfectly awakened one, wise about the world, Who first taught the vidyā-mantras On the Jambu continent.

source: །ད་ལྟར་བྱུང་དང་འདས་པ་དང་། །མ་བྱོན་སངས་རྒྱས་གང་ལགས་པ། །ཐམས་ཅད་ལ་ཡང་བདག་ཕྱག་འཚལ། །དེ་དག་ཀུན་ལ་སྐྱབས་སུ་མཆི།
en: I also pay homage to all buddhas, Those present, past, And yet to come— I go to them all for refuge.

source: །འཁོར་ལོ་བསྐོར་བ་བླ་མེད་པ། །མར་མེ་མཛད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Dīpaṅkara, Unexcelled turner of the wheel.

source: །ཆོས་ཀྱི་རྒྱལ་པོ་འོད་མཛད་པ། །ཐམས་ཅད་གནོན་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Sarvābhibhū, Illuminating king of Dharma.

source: །ཐམས་ཅད་མཁྱེན་པ་གྲགས་ལྡན་པ། །པདྨའི་བླ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Padmottara, The renowned omniscient one.

source: །སྤྱན་དང་ལྡན་པ་སྐྱོབ་མཛད་པ།
en: Homage to Atyuccagāmin, The visionary protector.

source: །རབ་འཐོར་གཤེགས་ལ་ཕྱག་འཚལ་ལོ། །དེད་དཔོན་བླ་ན་མེད་པ་པོ། །གྲགས་པའི་བླ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Yaśottara, The unexcelled guide.

source: །ཉི་ཟླ་ལྟ་བུར་འོད་མཛད་པ། །བདེ་མཛད་དེ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Kṣemaṅkara, Who shines like the sun and moon.

source: །ཆོས་ཀྱི་མེ་ལོང་སྟོན་པ་པོ། །དོན་གཟིགས་ལ་ཡང་ཕྱག་འཚལ་ལོ།
en: Homage to Arthadarśin, Who displays the mirror of Dharma.

source: །དུལ་བའི་ཚུལ་ཁྲིམས་འཇིགས་མེད་པ། །རྒྱལ་ཞེས་བྱ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the one called Puṣya, Fearless in the discipline that tames.

source: །མཚན་མཆོག་སུམ་ཅུ་རྩ་གཉིས་ལྡན། །སྐར་རྒྱལ་ལ་ཡང་ཕྱག་འཚལ་ལོ།
en: Homage to Tiṣya, Replete with the thirty-two supreme marks.

source: །རྫོགས་པའི་སངས་རྒྱས་དཔལ་ལྡན་པ། །རྣམ་པར་གཟིགས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Vipaśyin, Replete with the glory of perfect awakening.

source: །འོད་ཅན་གཟི་བརྗིད་ལྡན་པ་པོ། །གཙུག་ཏོར་ཅན་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Śikhin, Replete with light and radiance.

source: །ལེགས་པར་མཆོད་པ་གྲགས་ལྡན་པ། །ཐམས་ཅད་སྐྱོབ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Viśvabhū, Revered and renowned.

source: །བདུད་དཔུང་རབ་ཏུ་འཇོམས་པ་པོ། །ལོག་དད་སེལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Krakucchanda, Destroyer of the hordes of Māra.

source: །བྲམ་ཟེ་དཔལ་དང་ལྡན་པ་པོ། །གསེར་ཐུབ་དེ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Kanakamuni, The glorious brahmin.

source: །སེམས་ཅན་ཀུན་ལ་ཐུགས་བརྩེ་བ། །འོད་སྲུང་དེ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Kāśyapa, Who loves all beings.

source: །ཤཱཀྱ་སེང་གེ་འོད་མཛད་པ། །གསེར་མདོག་ཅན་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the golden one, Luminous lion of the Śākyas.

source: །སེར་སྣ་མེད་པ་ཐུགས་རྗེ་ཅན། །བྱམས་པ་ལ་ཡང་ཕྱག་འཚལ་ལོ།
en: And homage to Maitreya, The compassionate one free of avarice.

source: །སངས་རྒྱས་ཀུན་ལའང་ཕྱག་འཚལ་ཏེ། །དེ་དག་ལ་ནི་བདག་སྐྱབས་མཆི། །གང་དག་གིས་ནི་ཆོས་བསྟན་པ།
en: Having paid homage to all buddhas, I go to them for refuge.

source: །སངས་རྒྱས་ཀུན་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas, Teachers of the Dharma.

source: །གང་ལ་སངས་རྒྱས་གུས་མཛད་པའི། །ཆོས་ལ་བདག་ནི་ཕྱག་འཚལ་ལོ།
en: I pay homage to the Dharma, Revered by buddhas.

source: །གང་ལ་ཕུལ་ན་དོན་ཆེ་བའི། །དགེ་འདུན་ལ་ཡང་ཕྱག་འཚལ་ལོ།
en: Homage to the Saṅgha, To whom it is greatly beneficial to make offerings.

source: །ཉན་ཐོས་ཤེས་རབ་མཆོག་གྱུར་པ། །ཤཱ་རིའི་བུ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Śāriputra, Most insightful among śrāvakas.

source: །རྫུ་འཕྲུལ་ཅན་གྱི་མཆོག་གྱུར་པ། །མཽད་གལ་བུ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Maudgalyāyana, Supreme among those with miraculous powers.

source: །ཆོས་ཀྱི་གཏམ་ལ་འཇིགས་མེད་པ། །ཀཱ་ཏྱཱའི་བུ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Kātyāyana, Fearless in Dharma discourse.

source: །ཉན་ཐོས་སྦྱངས་པའི་མཆོག་གྱུར་པ། །འོད་སྲུང་ལ་ཡང་ཕྱག་འཚལ་ལོ།
en: Homage to Kāśyapa, The most ascetic among śrāvakas.

source: །སྐྱོབ་པ་ཡི་ནི་དབང་གྱུར་པ། །ཀཽཎྜི་ནྱ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Kauṇḍinya, Lord among protectors.

source: །མང་དུ་ཐོས་པ་རིག་སྔགས་འཆང་། །ཀུན་དགའ་བོ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Ānanda, Learned holder of vidyā-mantras.

source: །ལུས་ངན་དང་ནི་ཡུལ་འཁོར་སྲུང་། །མིག་མི་བཟང་དང་འཕགས་སྐྱེས་པོ། །ཕྱོགས་བཞི་ཁོ་ར་ཁོར་ཡུག་གི །རྒྱལ་ཆེན་རྣམས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Kubera, Dhṛtarāṣṭra, Virūpākṣa, and Virūḍhaka, The Great Kings Throughout the four directions.

source: །གནོད་སྦྱིན་རྣམས་ཀྱི་སྡེ་དཔོན་མཆོག །ཉི་ཤུ་བརྒྱད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the twenty-eight Supreme yakṣa generals.

source: །ཕ་མ་མཁན་པོ་སློབ་དཔོན་དང་། །ལྷ་རྣམས་ལ་ནི་ཕྱག་འཚལ་ལོ།
en: Homage to my parents, preceptor, and teacher, As well as to the gods.

source: །དེ་དག་ལ་ནི་ཕྱག་འཚལ་ནས། །རིག་སྔགས་འདི་ནི་གྲུབ་གྱུར་ཅིག །
en: After paying homage to them, May this vidyā-mantra succeed.

source: གང་གི་དོན་དུ་བྱ་བ་ཡི། །དོན་དེ་བདག་ལ་གྲུབ་གྱུར་ཅིག །
en: May I succeed in the purpose For which it is enacted.

source: སྡང་བར་སེམས་ཤིང་གནོད་བྱེད་པའི། །མི་མ་ཡིན་རྣམས་གུད་དུ་དེང་།
en: Hostile and harmful nonhumans, Go elsewhere.

source: །གནོད་པར་འདོད་པ་གླགས་ལྟ་རྣམས། །སྟོན་པའི་བསྟན་པ་མཉན་པར་གྱིས། །བྱམས་པར་སེམས་ཤིང་ཕན་འདོད་པའི།
en: Those who wish harm and seek weakness, Listen to the Teacher’s teaching.

source: །མི་མ་ཡིན་པ་གང་ཡིན་རྣམས། །ཐམས་ཅད་འདུས་ཤིང་མཐུན་གྱུར་ནས།
en: All nonhumans, Benevolent and altruistic, Gather and be in harmony.

source: །འཇིག་རྟེན་སྐྱོང་བ་རྣམས་ཀྱི་ཚིག །སྟོན་པས་རྗེས་སུ་ཡི་རང་བ། །དགའ་བའི་སེམས་ཀྱིས་བདག་ལ་ཉོན།
en: Joyfully listen to me— The words of the guardians of the world Were rejoiced in by the Teacher.

source: །བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་འདི་ནི་རྒྱལ་པོ་ཆེན་པོ་བཞིའི་བསྲུང་བ་ཆེན་པོ་སྟེ། འཁོར་བཞི་པོ་རྣམས་ལ་ཡོངས་སུ་ཁྱབ་པའོ། །གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། དྲི་ཟ་དང་། ཀླུ་དང་། ནམ་མཁའ་ལྡིང་དང་། གསང་བ་པ་དང་། འབྱུང་པོ་དང་། གྲུལ་བུམ་དང་། ཡི་དགས་དང་། སྲུལ་པོ་དང་། ཤ་ཟ་དང་། ལྷ་མ་ཡིན་དང་། རླུང་ལྷ་དང་། སྐེམ་བྱེད་དང་། འཚེ་རྒྱུ་དང་། སྨྱོ་བྱེད་དང་། མི་འམ་ཅི་དང་། གྱེན་དུ་རྒྱུ་དང་། རྒྱུ་བ་དང་། འདུན་པ་དང་། ངན་བྱེད་དང་། གཟི་བྱིན་འཕྲོག་པ་དང་། བརྗེད་བྱེད་དང་། རིམས་དྲག་པོ་དང་། རིམས་ཞག་གཅིག་པ་དང་། ཞག་གཉིས་པ་དང་། ཞག་གསུམ་པ་དང་། ཞག་བཞི་པ་དང་། མི་དང་མི་མ་ཡིན་པ། སྡང་བར་སེམས་པ་དང་། གླགས་ལྟ་བ་དང་། མི་ཕན་པར་འདོད་པ་དང་། གནོད་པར་བྱེད་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་མི་དགའ་བ་དང་།
en: This Great Sūtra of Cool Grove, the great protection of the Four Great Kings, covers all four communities.

source: གནོད་པར་འདོད་པ་དང་། ཕན་པར་མི་འདོད་པ་དང་། བདེ་བར་མི་འདོད་པ་དང་། གྲུབ་པ་དང་། བདེ་བར་མི་འདོད་པ་དང་། འཁོར་བཞི་པོ་རྣམས་ལ་མི་དགའ་བ་དང་། གནོད་པར་འདོད་པ་དང་། ཕན་པར་མི་འདོད་པ་དང་། བདེ་བར་མི་འདོད་པ་དང་། གྲུབ་པ་དང་། བདེ་བར་མི་འདོད་པ་དང་། མིང་འདི་ཞེས་བྱ་བ་ལ་མི་དགའ་བ་དང་། གནོད་པར་འདོད་པ་དང་། ཕན་པར་མི་འདོད་པ་དང་། བདེ་བར་མི་འདོད་པ་དང་། གྲུབ་པ་དང་། བདེ་བར་མི་འདོད་པ་གང་ཡིན་པ་དེ་དག་ནི་བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་འདི་ཐོས་ནས་དེངས་ཤིག །
en: All you yakṣas, rākṣasas, gandharvas, nāgas, garuḍas, guhyakas, bhūtas, kumbhāṇḍas, pretas, pūtanas, piśācas, asuras, marutas, skandas, mischief makers, unmādas, kinnaras, upward movers, wandering beings, covetous ones, evildoers, stealers of vitality, and apasmāras; all intense fevers, one-day fevers, two-day fevers, three-day fevers, and four-day fevers; all humans and nonhumans who are hostile, search for weakness, have malicious intent, and perpetrate violence; all who do not like the teaching of the blessed Buddha, wish to harm it, do not want to benefit it, do not wish it well, and do not want it to succeed or be secure; all who do not like the four communities, wish to harm them, do not want to benefit them, do not wish them well, and do not want them to succeed or be secure; all who do not like the person with such-and-such a name, want to harm them, do not want to benefit them, and do not want them to be well, succeed, or be secure—having heard this Great Sūtra of Cool Grove, depart.

source: སྐྲག་པར་གྱུར་ཅིག །
en: May you be scared.

source: དངངས་པར་གྱུར་ཅིག །
en: May you be frightened.

source: ཀུན་ཏུ་དངངས་པར་གྱུར་ཅིག །
en: May you be terrified.

source: འདི་ན་མ་འཁོད་ཅིག །
en: Do not remain here.

source: ངན་སེམས་དང་གནོད་སེམས་ཀྱི་མགོ་བོ་ཚལ་པ་བདུན་དུ་འགས་ཏ་རེ། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། དྲི་ཟ་དང་། ཀླུ་དང་། ནམ་མཁའ་ལྡིང་དང་། གསང་བ་པ་དང་། འབྱུང་པོ་དང་། གྲུལ་བུམ་དང་། ཡི་དགས་དང་། སྲུལ་པོ་དང་། ཤ་ཟ་དང་། ལྷ་མ་ཡིན་དང་། རླུང་ལྷ་དང་། སྐེམ་བྱེད་དང་། འཚེ་རྒྱུ་དང་། སྨྱོ་བྱེད་དང་། མི་འམ་ཅི་དང་། གྱེན་དུ་རྒྱུ་དང་། རྒྱུ་བ་དང་། འདུན་པ་དང་། ངན་བྱེད་དང་། གཟི་བྱིན་འཕྲོག་པ་དང་། བརྗེད་བྱེད་དང་། རིམས་དྲག་པོ་དང་། རིམས་ཞག་གཅིག་པ་དང་། ཞག་གཉིས་པ་དང་། ཞག་གསུམ་པ་དང་། ཞག་བཞི་པ་དང་། མི་དང་མི་མ་ཡིན་པ་སྡང་བར་སེམས་པ་མ་ཡིན་པ་རྣམས་དང་། གླགས་མི་ལྟ་བ་དང་། ཕན་པར་འདོད་པ་དང་། གནོད་པར་མི་འདོད་པ་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་དགའ་བ་དང་། དོན་དུ་འགྱུར་བར་འདོད་པ་དང་། ཕན་པར་འདོད་པ་དང་། བདེ་བར་འདོད་པ་དང་། གྲུབ་པ་དང་། བདེ་བར་འདོད་པ་དང་། མིང་འདི་ཞེས་བྱ་བ་ལ་དགའ་བ་དང་།
en: May the heads of the evil and malicious split into seven pieces.

source: དོན་དུ་འགྱུར་བར་འདོད་པ་དང་། ཕན་པར་འདོད་པ་དང་། བདེ་བར་འདོད་པ་དང་། གྲུབ་པ་དང་། བདེ་བར་འདོད་པ་གང་ཡིན་པ་དེ་དག་ནི་བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་འདི་ཐོས་ནས་འདིར་འཁོད་ཅིག །
en: All you yakṣas, rākṣasas, gandharvas, nāgas, garuḍas, guhyakas, bhūtas, kumbhāṇḍas, pretas, pūtanas, piśācas, asuras, marutas, skandas, mischief makers, unmādas, kinnaras, upward movers, wandering beings, covetous ones, evildoers, stealers of vitality, and apasmāras; all intense fevers, one-day fevers, two-day fevers, three-day fevers, and four-day fevers; all humans and nonhumans who are not hostile, do not search for weakness, do not have malicious intent, and do not perpetrate violence; all who like the teaching of the blessed Buddha, want to benefit and assist it, wish it well, and want it to be successful and secure; all who like the person with such-and-such a name, want to benefit and assist them, wish them well, and want them to be successful and secure—having heard this Great Sūtra of Cool Grove, remain here.

source: མ་སྐྲག་ཅིག །
en: Do not be scared.

source: མ་དངངས་པར་གྱུར་ཅིག །
en: Do not be frightened.

source: ཀུན་ཏུ་དངངས་པར་མ་གྱུར་ཅིག །
en: Do not be terrified.

source: མི་འཇིགས་པ་ཁོ་ནར་གྱུར་ཅིག །
en: Be nothing but fearless.

source: མིང་འདི་ཞེས་བྱ་བའི་དོན་དང་། ཕན་པ་དང་། བདེ་བ་དང་། བདེ་བར་གནས་པར་བྱ་བའི་ཕྱིར། བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་འདི་བདག་གིས་བསྟན་ཅིང་བཤད་པར་བྱའོ།
en: For the benefit, assistance, happiness, and security of the person with such-and-such a name, I will teach and explain this Great Sūtra of Cool Grove.

source: །དེ་ལ་བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་བདག་ལ་བསྲུང་བ་ནི་འདི་ཡིན་ཏེ། སྱཱད་ཡ་ཐེ་དན། ཁ་ཊེ་ཁ་ཊེ། ཁཏྟྱ་སི། པ་ལ་ཀ་བ་ཊེ། རོ་ག་བྷ་དྲི་ག་ཎེ། ཧི་ལི་ཧི་ལི། དུ་མ་ཏེ། གྲྀཏྟ་ཏི། ཨ་ཛ་ཊི། ཀ་ཐ་རི། མ་སཱ་ར་ཀལྤེ། ས་མནྟེ་ན། ཙ་ཏུདྡི་ཤི །ཡོ་ཛ་ན་ཤ་ཏ། ཨཱཏྨ་རཀྵ། ཨ་ན་ཏི་ཀྲ་མ་ཎི། སརྦ་བི་ཧེ་ཋ་ཀེ་བྷྱཿན་མོ་བྷ་ག་བ་ཏེ། བུད་དྷ་སྱ། སིད་དྷྱནྟུ་མནྟྲ་པ་དཱ། ད་ར་དུ་བི་དྱཱ། བྲཧྨ་ཎོ།
en: The Great Sūtra of Cool Grove that protects oneself is as follows: Syād yathedam khaṭe khaṭe khattyasi palakavaṭe rogabhadrigaṇe hili hili dumate gṛttati ajaṭi kathari masārakalpe samantena caturdiśi yojanaśata ātmarakṣa anatikramaṇi sarva­viheṭhakebhyaḥ namo bhagavate buddhasya siddhyantu mantrapadā daraduvidyā brahmaṇo manadu svāhā Thus did I hear at one time.

source: མ་ན་དུ་སྭཱ་ཧཱ། འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན། བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན། དུར་ཁྲོད་ཆེན་པོ་བསིལ་བའི་ཚལ་འཇིགས་སུ་རུང་བ་སྐྱི་བུང་ཞེས་བྱེད་པ་ན། དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ།
en: The Blessed One was dwelling in Rājagṛha at the horrific and hair-raising great charnel ground Cool Grove, together with a large monastic assembly of 1,250 monks.

source: །དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལུས་ངན་དང་། ཡུལ་འཁོར་སྲུང་དང་། མིག་མི་བཟང་དང་། འཕགས་སྐྱེས་པོ་བུ་དང་བཅས། བློན་པོ་དང་བཅས། འཁོར་དང་བཅས། མངག་གཞུག་པ་དང་བཅས། ཕོ་ཉ་དང་བཅས། གཡོག་འཁོར་དང་བཅས་པ་ཁ་དོག་འཕགས་པ་དག་ནམ་ཕྱེད་ན་ལྷགས་ནས་གྲོས་མཐུན་པར་དུར་ཁྲོད་ཆེན་པོ་བསིལ་བའི་ཚལ་དུ་དོང་སྟེ།
en: The Four Great Kings—Kubera, Dhṛtarāṣṭra, Virūpākṣa, and Virūḍhaka—with their sons, ministers, entourages, retainers, messengers, and servants, appeared at midnight in their majestic glory, arriving in the great charnel ground of Cool Grove with a single intent.

source: རང་བཞིན་གྱི་ཁ་དོག་དང་མཐུས་འོད་ཆེན་པོས་སྣང་བར་བྱས་ནས།
en: Through their natural radiance and power they flooded the place with bright light.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཐལ་མོ་སྦྱར་ཏེ།
en: They then approached the Blessed One, bowed their heads to his feet, and circumambulated him three times.

source: བཅོམ་ལྡན་འདས་འབའ་ཞིག་ལ་ཕྱག་འཚལ་ཞིང་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: Then, with palms joined they prostrated only to him and stood to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པས་བསྟོད་པ། འཇིག་རྟེན་མཁས་པ་རྫོགས་སངས་རྒྱས། །དཔའ་ཆེན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །གཽ་ཏམ་ཁྱོད་ཀྱིས་གང་མཁྱེན་པ།
en: Thus standing to one side, the Four Great Kings praised the Blessed One in verse: “Homage to you, great hero, Perfectly awakened one, wise about the world.

source: །དེ་ནི་ལྷ་རྣམས་མ་འཚལ་ཏོ།
en: The gods have not grasped What you, Gautama, know.”

source: །ལན་གཉིས་ལན་གསུམ་དུ་ཡང་རྒྱལ་པོ་ཆེན་པོ་བཞིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་ནས་བསྟོད་པ། འཇིག་རྟེན་མཁས་པ་རྫོགས་སངས་རྒྱས། །དཔའ་ཆེན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །གཽ་ཏམ་ཁྱོད་ཀྱིས་གང་མཁྱེན་པ།
en: The Four Great Kings then praised the Blessed One with this verse a second and third time: “Homage to you, great hero, Perfectly awakened one, wise about the world.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་ཆེན་པོ་བཞིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ཡུལ་དང་འཕྲོད་ལགས་སམ།
en: The Four Great Kings then said to the Blessed One, “Venerable Blessed One, does this place agree with you?

source: འཚོ་བ་དང་ལྡན་ལགས་སམ།
en: Do you have sustenance?

source: བཙུན་པ་བཅོམ་ལྡན་འདས་སྐུ་བདེ་ལགས་སམ།
en: Venerable Blessed One, are you healthy?

source: སྙུན་མི་མངའ་ལགས་སམ།
en: Are you free of illness?

source: ཉམ་ང་བ་མ་མཆིས་སམ།
en: Are you without discomfort?

source: བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་གནོད་པ་མི་མངའ་ལགས་སམ། བཅོམ་ལྡན་འདས་ལ་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། དྲི་ཟ་དང་། ཀླུ་དང་། ནམ་
en: Does nothing harm the Blessed One’s body? “

source: མཁའ་ལྡིང་དང་། གསང་བ་པ་དང་། འབྱུང་པོ་དང་། གྲུལ་བུམ་དང་། ཡི་དགས་དང་། སྲུལ་པོ་དང་། ཤ་ཟ་དང་། ལྷ་མ་ཡིན་དང་། རླུང་ལྷ་དང་། སྐེམ་བྱེད་དང་། འཚེ་རྒྱུ་དང་། སྨྱོ་བྱེད་དང་། མི་འམ་ཅི་དང་། གྱེན་དུ་རྒྱུ་དང་། རྒྱུ་བ་དང་། འདུན་པ་དང་། ངན་བགྱིད་དང་། གཟི་བྱིན་འཕྲོག་པ་དང་། བརྗེད་བྱེད་དང་། རིམས་དྲག་པོ་དང་། རིམས་ཞག་གཅིག་པ་དང་། ཞག་གཉིས་པ་དང་། ཞག་གསུམ་པ་དང་། ཞག་བཞི་པ་དང་། མི་དང་། མི་མ་ཡིན་པ་སྡང་བར་སེམས་པ་དང་། གླགས་ལྟ་བ་དང་། ཕན་པར་མི་འདོད་པ་དང་། གནོད་པར་བགྱིད་པ་དག་ལས་གནོད་པར་བགྱིད་པར་སེམས་པ་ལྟ་མ་མཆིས་ལགས་སམ།
en: Are there no yakṣas, rākṣasas, gandharvas, nāgas, garuḍas, guhyakas, bhūtas, kumbhāṇḍas, pretas, pūtanas, piśācas, asuras, marutas, skandas, mischief makers, unmādas, kinnaras, upward movers, wandering beings, covetous ones, evildoers, stealers of vitality, or apasmāras, intense fevers, one-day fevers, two-day fevers, three-day fevers, or four-day fevers, or humans or nonhumans who hate the Blessed One, search for weakness, have malicious intent, are harmful toward him, or even have the intention of being harmful?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀྱེ་རྒྱལ་པོ་ཆེན་པོ་དག་ང་ལ་ནི་ཐམས་ཅད་ཡོད་དེ།
en: The Blessed One responded to the Four Great Kings, “I have everything, Great Kings.

source: ཡུལ་དང་ཡང་འཕྲོད། འཚོ་བ་དང་ཡང་ལྡན། ལུས་ཀྱང་བདེ། ནད་ཀྱང་མེད། ཉམ་ང་བ་ཡང་མེད་དོ།
en: The place agrees with me, I have sustenance, my health is good, I am free of illness, and I am without discomfort.

source: །ཀྱེ་རྒྱལ་པོ་ཆེན་པོ་དག་ངའི་ལུས་ལ་ནི་གནོད་པ་ཡང་མེད་དོ། །ཀྱེ་རྒྱལ་པོ་ཆེན་པོ་དག་ངས་ནི་འཇིག་རྟེན་ལྷ་དང་བཅས་པ།
en: Great Kings, there is no one harming my body. “

source: བདུད་དང་བཅས་པ། ཚངས་པ་དང་བཅས་པ། དགེ་སྦྱོང་དང་། བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུ་དང་། ལྷ་དང་མིར་བཅས་པའི་ནང་ན་གང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་གནོད་པ་བྱེད་པར་སེམས་པ་ཡང་དག་པར་མ་མཐོང་ངོ་།
en: Great Kings, I have not seen anyone at all in the world, including gods, māras, and Brahmā; anyone among humans, including mendicants and brahmins; or anyone else among gods and humans who intends to harm the thus-gone, worthy, completely perfect Buddha.

source: །ཀྱེ་རྒྱལ་པོ་ཆེན་པོ་དག་དེ་ལྟ་མོད་ཀྱི། ཁྱོད་ཀྱི་འཁོར་རྣམས་ངའི་འཁོར་ལ་གནོད་པ་བྱེད་པར་སེམས་སོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: Great Kings, it is rather your communities that intend to harm my community.”

source: བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་ཆེན་པོ་བཞིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་གསོལ་བ་མཆིས་ཏེ། དེའི་སླད་དུ་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་ཕྱག་བགྱི་བ་དང་། བསྙེན་བཀུར་བགྱི་བ་དང་། བཅོམ་ལྡན་འདས་ཉིད་ལ་ཞུ་བའི་སླད་དུ་བདག་ཅག་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་མཆིས་ལགས་སོ།
en: The Four Great Kings said to the Blessed One, “Venerable Blessed One, we have been informed of this, thus we have come before the Blessed One to honor you, pay homage, pay respect, and petition the Blessed One in person.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why?

source: བཙུན་པ་བཅོམ་ལྡན་འདས་དགོན་པ་དང་། བས་མཐའི་གནས་མལ་འདི་དག་ན་ཤིན་ཏུ་སྡང་བའི་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། དྲི་ཟ་དང་། ཀླུ་དང་། ནམ་མཁའ་ལྡིང་དང་། གསང་བ་པ་དང་། འབྱུང་པོ་དང་། གྲུལ་བུམ་དང་། ཡི་དགས་དང་། སྲུལ་པོ་དང་། ཤ་ཟ་དང་། ལྷ་མ་ཡིན་དང་། རླུང་ལྷ་དང་། སྐེམ་བྱེད་དང་། འཚེ་རྒྱུ་དང་། སྨྱོ་བྱེད་དང་། མི་འམ་ཅི་དང་། གྱེན་དུ་རྒྱུ་དང་། རྒྱུ་བ་དང་། འདུན་པ་དང་། ངན་བྱེད་དང་། གཟི་བྱིན་འཕྲོག་པ་དང་། བརྗེད་བྱེད་དང་། རིམས་དྲག་པོ་དང་། རིམས་ཞག་གཅིག་པ་དང་། ཞག་གཉིས་པ་དང་། ཞག་གསུམ་པ་དང་། ཞག་བཞི་པ་དང་། མི་དང་མི་མ་ཡིན་པ་སྡང་བར་སེམས་པ་དང་།
en: Venerable Blessed One, at remote wilderness retreats there are extremely malicious yakṣas, rākṣasas, gandharvas, nāgas, garuḍas, guhyakas, bhūtas, kumbhāṇḍas, pretas, pūtanas, piśācas, asuras, marutas, skandas, mischief makers, unmādas, kinnaras, upward movers, wandering beings, covetous ones, evildoers, stealers of vitality, and apasmāras, intense fevers, one-day fevers, two-day fevers, three-day fevers, and four-day fevers, and humans and nonhumans who are hateful, search for weakness, have malicious intent, and perpetrate violence.

source: གླགས་ལྟ་བ་དང་། ཕན་པར་མི་སེམས་པ་དང་། གནོད་པར་བགྱིད་པ་དག་མཆིས་སོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་དེ་དག་ཀྱང་དེ་ན་གནས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་དེ་དག་ནི་སྲོད་དང་ཐོ་རངས་མི་ཉལ་བར་སྦྱོར་བ་ལ་བརྩོན་པར་གནས་ལགས་སོ།
en: The śrāvakas of the venerable Blessed One also dwell at those places, exerting themselves in practice without resting at dawn or dusk.

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་གནོད་སྦྱིན་ནམ་སྲིན་པོ་ནས་གནོད་པར་བགྱིད་པའི་བར་དག་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་འདི་ལ་དད་པའི་སེམས་དང་ལྡན་པ་ནི་ཉུང་ཟད་ཅིག་མཆིས་པར་བས་སོ། །གང་དག་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་འདི་ལ་མ་དད་པའི་སེམས་དང་ལྡན་པ་ནི་ཆེས་མང་ལགས་ཏེ། དེ་དག་ནི་བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་སྲོད་དང་ཐོ་རངས་ལ་མི་ཉལ་ཞིང་སྦྱོར་བ་ལ་བརྩོན་པར་གནས་པ་རྣམས་ལ་གནོད་པར་བགྱིད་པར་སེམས་ལགས་ཏེ། དེ་དག་དགག་པའི་སླད་དུ་གནོད་སྦྱིན་མ་རུངས་པ་མ་དད་པ་རྣམས་དད་པར་བགྱི་བ་དང་།
en: Venerable Blessed One, from the yakṣas and rākṣasas up to those perpetrating violence, there are very few with trust in the Blessed One’s teaching, and there are a great many who lack trust in the Blessed One’s teaching and intend to harm the śrāvakas of the Blessed One who stay in these places, exerting themselves in practice without resting at dawn or dusk.

source: དད་པ་རྣམས་སླར་ཞིང་དད་པར་བགྱི་བ་དང་། འཁོར་བཞི་པོ་རྣམས་བདེ་ལེགས་དང་། བདེ་བར་གནས་པར་བགྱི་བ་དང་། མ་ལུས་པར་ཤིན་ཏུ་མཉམ་པར་གཞོག་པར་འགྱུར་བའི་སླད་དུ། བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་འདི་བཤད་པར་འཚལ་ལོ།
en: In order to stop them, so that the pernicious yakṣas without trust can gain trust, so that those with trust can be increase their trust, and so that the four communities can have well-being, dwell at ease, and meditate well without exception, was ask you to expound The Great Sūtra of Cool Grove. “

source: །མི་མ་ཡིན་པ་སྡང་སེམས་ཅན། །རྒྱལ་བའི་བསྟན་ལ་མ་དད་པ། །དེ་དག་བདག་གིས་བཟློག་པར་བྱ།
en: We will repel Hostile nonhumans Who lack devotion to the Victor’s teaching.

source: །རྒྱལ་ཆེན་རྣམས་ནི་བདག་ལ་ཉོན།
en: Listen to us, the Four Great Kings. “

source: །མདོ་ཆེན་འདི་ནི་ཐོས་ནས་ཀྱང་། །མི་རྣམས་ལ་ནི་གནོད་མ་བྱེད།
en: Once you have heard this great sūtra, Do not harm humans. “

source: །གནོད་སྦྱིན་སྲིན་པོ་ཀླུ་རྣམས་དང་། །ནམ་མཁའ་ལྡིང་དང་གསང་བ་པ། །ཕན་པར་མི་འདོད་གང་ཡང་རུང་། །དེ་དག་ཐམས་ཅད་བཟློག་པར་བྱ།
en: Yakṣas, rākṣasas, nāgas, Garuḍas, and guhyakas, Whoever does not wish to be helpful— We repel them all. “

source: །ལྷ་དང་ལྷ་མིན་རླུང་ལྷ་དང་། །ལྷ་མོའི་ཚོགས་ཀྱིས་གང་བ་ཡི། །གཞལ་མེད་ཁང་མཛེས་དེ་དག་ནི། །མེ་དང་འདྲ་བར་འོད་གསལ་ཞིང་།
en: The exquisite mansions Filled with assemblies of gods, Asuras, marutas, and goddesses Radiate light like fire. “

source: །ཉི་མ་ཟླ་བའི་ཚུལ་འདྲ་བ། །རིན་ཆེན་ལས་བྱས་ཤིན་ཏུ་སྣང་།
en: Made of jewels, they shine brightly, Just like the sun and moon.

source: །བསོད་ནམས་བྱས་པ་དག་གིས་གང་། །རབ་སྣང་གདོན་རྣམས་རྣམ་པར་སྤངས།
en: Filled with merit makers, They shine, devoid of grahas. “

source: །མི་ལ་གནོད་བྱེད་གང་ཡིན་པའི། །འབྱུང་པོ་གྲུལ་བུམ་སྲིན་པོ་དང་། །ཡི་དགས་སྲུལ་པོ་དེ་དག་གིས། །རྨད་བྱུང་དེ་དག་མི་མཐོང་སྟེ།
en: Bhūtas, kumbhāṇḍas, rākṣasas, Pretas, and pūtanas Who harm humans Do not see their splendor.

source: །གཟི་བྱིན་ལྡན་པའི་ལྷ་རྣམས་ཀྱི། །གྲོང་ཁྱེར་དུ་ཡང་དེ་མི་འགྲོ།
en: They do not travel to the city Of the majestic gods. “

source: །འབྱུང་པོ་ཆེན་པོ་འདུ་བ་ན། །དེ་ཡང་དེ་དག་འདུར་མི་དབང་།
en: They will be unable to gather Where great bhūtas gather.

source: །སྟན་ནམ་ཡང་ན་ཆུ་ཡང་རུང་། །ཟས་དང་སྐོམ་ཡང་མི་དབང་ངོ་། །ལུས་ངན་གྱི་ནི་ཕོ་བྲང་དུ།
en: They have no control, wherever they are, Over food and drink, not even water. “

source: །ནམ་ཡང་དེ་དག་འགྲོ་མི་འགྱུར།
en: They will never travel To the palace of Kubera. “

source: །རྒྱལ་པོ་ཆེན་པོ་རྣམས་ཀྱི་ཚིག །འབྱུང་པོ་གང་ཞིག་མི་ཉན་པ། །དེ་ཡི་ཁ་ནས་ཁྲག་དྲོན་དག །མྱུར་དུ་རབ་ཏུ་འབབ་པར་འགྱུར།
en: Any bhūtas who do not listen To the words of the Great Kings Will have warm blood Gush swiftly from their mouths. “

source: །དེ་ཡི་བརླ་ཡི་གཡས་རོལ་ནས། །ཕོལ་མིག་དག་ཀྱང་འབྱུང་འགྱུར་ཏེ།
en: Boils will appear On the right sides of their thighs.

source: །དེ་ནི་ནད་ཀྱིས་འཆི་འགྱུར་ཞིང་། །གནོད་སྦྱིན་གཟུགས་ཀྱང་སྟོན་པར་འགྱུར།
en: They will be killed by disease, And their yakṣa forms will be revealed. “

source: །འཇིག་རྟེན་སྐྱོང་གིས་བཤད་པ་ཡི། །མདོ་ལས་གང་ཞིག་འགལ་བྱེད་པ། །འཇིགས་པ་ཐམས་ཅད་དེ་ལ་འོང་། །མགོ་བོ་ཚལ་པ་བདུན་དུ་འགས།
en: Whoever transgresses the sūtra Spoken by the guardians of the world Will experience every fear, And their head will split into seven pieces. “

source: །རྒྱལ་པོ་ཆེན་པོ་རྣམས་ཀྱི་ཚིག །གནོད་སྦྱིན་གང་དག་མི་ཉན་པ། །འབྱུང་པོ་སྲིན་པོ་གང་ཡོད་པ། །ངན་ཕྲེང་ལྷག་པའི་ངན་ཕྲེང་རྣམས། །ལྕགས་ལས་བྱས་པའི་འཁོར་ལོ་ཡི། །མཚོན་ཆ་སྤུ་གྲིའི་སོ་འདྲ་བས། །གནོད་སྦྱིན་དེ་དག་བརླག་པར་བྱ།
en: Yakṣas who do not listen To the words of the Great Kings, And all the bhūtas and rākṣasas there are, Making up a garland of great evil, Will be destroyed by a disk of iron, A weapon with razor-like teeth. “

source: །རྒྱལ་པོ་ཆེན་པོ་དཔལ་དང་ལྡན། །གོ་ཆ་སྲ་ཞིང་མཚོན་རྣོ་ལ། །སྟན་རྣམས་ལ་ནི་འཁོད་པ་དག །ཤར་ཕྱོགས་ན་ནི་ཡུལ་འཁོར་སྲུང་། །ལྷོ་ཕྱོགས་ན་ནི་འཕགས་སྐྱེས་པོ། །ནུབ་ཕྱོགས་ན་ནི་མིག་མི་བཟང་། །བྱང་ཕྱོགས་ན་ནི་ལུས་ངན་པོ།
en: The glorious Great Kings, With hard armor and sharp weapons, Are seated on thrones: In the east is Dhṛtarāṣṭra, In the south is Virūḍhaka, In the west is Virūpākṣa, And in the north is Kubera. “

source: །དེ་དག་དེ་ན་འཁོད་པ་ཡི། །ཉེ་འཁོར་གནོད་སྦྱིན་འདི་རྣམས་གནས། །སེང་གེའི་གཟུགས་དང་སྟག་གི་གཟུགས། །མི་སྡུག་པ་དག་འགྲོ་ཞིང་རྒྱུ།
en: All around them stand A host of yakṣas, Roaming and darting about, Taking the hideous forms Of lions and tigers. “

source: །གླང་ཆེན་གཟུགས་དང་རྟ་ཡི་གཟུགས། །ཁ་ཅིག་མ་ཧེའི་གཟུགས་ཅན་ལ། །དྲེད་མོ་དང་ནི་ཝ་ཡི་གཟུགས། །ལུག་དང་སྤྱང་ཀི་ཕག་རྒོད་རྣམས།
en: Some have elephant forms, some horse forms; Others have buffalo forms Or the forms of bears or foxes, Sheep, wolves, and boars.

source: །རྣ་བ་འཕྱང་དང་རྣ་བོ་ཆེ། །རྣ་བ་གཅིག་པ་ཐ་དད་པ།
en: Some have drooping ears, others’ are large; Some have one ear, others many. “

source: །སྒྲ་ཆེར་འབྱིན་ཅིང་འཇིགས་བྱེད་པ། །ས་གཞི་རབ་ཏུ་གཡོ་བར་བྱེད།
en: They make loud noises, cause fear, And make the ground tremble.

source: །བོང་བུ་དང་ནི་རྔ་མོ་ཁྱི། །ཆ་ལུགས་གཞན་ཡང་ཉེ་འཁོར་འཁོད།
en: They are arrayed in the various forms Of mules, camels, dogs, and others. “

source: །རྒྱལ་པོ་ཆེན་པོ་སྟོབས་པོ་ཆེ། །དེ་དག་ཕན་ཚུན་འདུ་བ་ན། །ལྷ་ཡི་ཤིང་རྟ་བཅས་པ་ཡིས། །ནམ་མཁའ་ལས་ནི་འགྲོ་བར་བྱེད།
en: The Great King of tremendous might Was transported through the sky On a divine chariot To where these yakṣas gathered together. “
